Revit 2026 API

# FilteredElementCollectorGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<Element> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of Element)
```
```cpp
public:
virtual IEnumerator<Element^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<Element>
override GetEnumerator : unit -> IEnumerator<Element>
```

#### Return Value

IEnumeratorElementAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace